package main

import "fmt"

/*
Удалить i-ый элемент из слайса.
*/

func main() {
	sl := []string{"Ф", "И", "К", "У", "У", "С"}
	i := 3
	//Способ 1 быстрый(не соблюдает порядок)
	sl[i] = sl[len(sl)-1]
	//Удаляем последний элемент, записываем нулевое значение
	sl[len(sl)-1] = ""
	//Усекаем срез
	sl = sl[:len(sl)-1]

	fmt.Println(sl)

	//Способ 2. медленный с сохранением порядка
	sl2 := []string{"Ф", "И", "К", "У", "У", "С"}
	//Выполнить сдвиг a[i+1:] влево на один индекс.
	copy(sl2[i:], sl2[i+1:])
	//Удаляем последний элемент
	sl2[len(sl2)-1] = ""
	//Усекаем срез
	sl2 = sl2[:len(sl2)-1]
	fmt.Println(sl2)
}
